[Killed] BlockStatement
src/app/greet.pipe.ts:5:50
 
 @Pipe({ name: 'greet' })
 export class GreetPipe implements PipeTransform {
-    transform(value: string | undefined): string {
-        if (value) return `Hey ${value}!`;
-        return '';
-    }
+    transform(value: string | undefined): string {}
 }
killedBy: GreetPipe transform should return "Hey Hanno!" when called with "Hanno"
statusReason: Expected undefined to be 'Hey Hanno!'.

[Killed] ConditionalExpression
src/app/greet.pipe.ts:6:13
 @Pipe({ name: 'greet' })
 export class GreetPipe implements PipeTransform {
     transform(value: string | undefined): string {
-        if (value) return `Hey ${value}!`;
+        if (false) return `Hey ${value}!`;
         return '';
     }
killedBy: GreetPipe transform should return "Hey Hanno!" when called with "Hanno"
statusReason: Expected '' to be 'Hey Hanno!'.

[Killed] ConditionalExpression
src/app/greet.pipe.ts:6:13
 @Pipe({ name: 'greet' })
 export class GreetPipe implements PipeTransform {
     transform(value: string | undefined): string {
-        if (value) return `Hey ${value}!`;
+        if (true) return `Hey ${value}!`;
         return '';
     }
killedBy: GreetPipe transform should return empty String when called with undefined
statusReason: Expected 'Hey undefined!' to be ''.
