[Killed] BooleanLiteral
src/app/greet.pipe.ts:5:52
 
 @Pipe({ name: 'greet' })
 export class GreetPipe implements PipeTransform {
-transform(value: string | undefined, toLowercase = false): string {
+transform(value: string | undefined, toLowercase = true): string {
         if (!value) return '';
         return `Hey ${toLowercase ? value.toLowerCase() : value}`
killedBy: GreetPipe transform should return "Hey Hanno!" when called with "Hanno"
statusReason: Expected 'Hey hanno' to be 'Hey Hanno'.

[Killed] BlockStatement
src/app/greet.pipe.ts:5:67
 
 @Pipe({ name: 'greet' })
 export class GreetPipe implements PipeTransform {
-transform(value: string | undefined, toLowercase = false): string {
-        if (!value) return '';
-        return `Hey ${toLowercase ? value.toLowerCase() : value}`
-    }
+transform(value: string | undefined, toLowercase = false): string {}
 }
killedBy: GreetPipe transform should return "Hey Hanno!" when called with "Hanno"
statusReason: Expected undefined to be 'Hey Hanno'.

[Killed] ConditionalExpression
src/app/greet.pipe.ts:6:13
 @Pipe({ name: 'greet' })
 export class GreetPipe implements PipeTransform {
 transform(value: string | undefined, toLowercase = false): string {
-        if (!value) return '';
+        if (true) return '';
         return `Hey ${toLowercase ? value.toLowerCase() : value}`
     }
killedBy: GreetPipe transform should return "Hey Hanno!" when called with "Hanno"
statusReason: Expected '' to be 'Hey Hanno'.

[Killed] BooleanLiteral
src/app/greet.pipe.ts:6:13
 @Pipe({ name: 'greet' })
 export class GreetPipe implements PipeTransform {
 transform(value: string | undefined, toLowercase = false): string {
-        if (!value) return '';
+        if (value) return '';
         return `Hey ${toLowercase ? value.toLowerCase() : value}`
     }
killedBy: GreetPipe transform should return "Hey Hanno!" when called with "Hanno"
statusReason: Expected '' to be 'Hey Hanno'.

[Killed] MethodExpression
src/app/greet.pipe.ts:7:37
 export class GreetPipe implements PipeTransform {
 transform(value: string | undefined, toLowercase = false): string {
         if (!value) return '';
-        return `Hey ${toLowercase ? value.toLowerCase() : value}`
+        return `Hey ${toLowercase ? value.toUpperCase() : value}`
     }
 }
killedBy: GreetPipe transform should return "Hey hanno!" when called with "Hanno" and toLowercase set to "true"
statusReason: Expected 'Hey HANNO' to be 'Hey hanno'.
